In [1]:
import pandas as pd
import numpy as np
import joblib

In [2]:
df=pd.read_csv('data/Traffic_Accident.csv', index_col=0, encoding='cp949')

In [3]:
df

    시도별   월별  사고건수(건)  사망자수(명)  부상자수(명)
1    서울   1월     2874       18     3868
2    서울   2월     2176       16     2919
3    서울   3월     2187       12     2852
4    서울   4월     2847       23     3905
5    서울   5월     3030       19     4065
..   ..  ...      ...      ...      ...
216  제주   8월      373        4      570
217  제주   9월      326        7      465
218  제주  10월      366        4      554
219  제주  11월      325        4      436
220  제주  12월      296        3      428

[204 rows x 5 columns]

In [84]:
df.isna().sum()

시도별        0
월별         0
사고건수(건)    0
사망자수(명)    0
부상자수(명)    0
dtype: int64

In [85]:
df.describe()

           사고건수(건)     사망자수(명)      부상자수(명)
count   204.000000  204.000000   204.000000
mean    964.882353   13.406863  1381.387255
std    1043.442987   11.622814  1493.822304
min      44.000000    0.000000    56.000000
25%     501.000000    4.000000   709.500000
50%     660.500000   11.000000   972.000000
75%     898.750000   18.000000  1275.500000
max    4982.000000   60.000000  7410.000000

In [4]:
df['시도별'].unique()

array(['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북',
       '충남', '전북', '전남', '경북', '경남', '제주'], dtype=object)

In [5]:
df_city=df.drop(labels='사망자수(명)', axis=1)

In [20]:
df.loc[df_city['사고건수(건)'] == df_city['사고건수(건)'].max(),'월별']

116    12월
Name: 월별, dtype: object

In [21]:
val_col = ['사고건수(건)','사망자수(명)','부상자수(명)']

In [22]:
selected_city = '서울'

In [23]:
df_city = df.loc[df['시도별']==selected_city,].reset_index(drop=True)

In [57]:
list(df_city.loc[df_city[val_col[0]]==df_city[val_col[0]].max(),'월별'])[0]

'10월'

In [70]:
list(df_city.loc[df_city[val_col[1]] == df_city[val_col[1]].max(),'월별'])[0]

'12월'

In [71]:
selected_month ='1월'

In [72]:
df_month = df.loc[df['월별']==selected_month,].reset_index(drop=True)

In [77]:
df_month.loc[df_month[val_col[0]]==df_month[val_col[0]].max(),]

  시도별  월별  사고건수(건)  사망자수(명)  부상자수(명)
8  경기  1월     4539       38     6641

In [80]:
list(df_month.loc[df_month[val_col[0]]==df_month[val_col[0]].max(),'시도별'])[0]

'경기'